# St7SetBeamLineThickness

Sets the thickness of beam outlines.

long St7SetBeamLineThickness(long uID, long Thickness)
Input Parameters
uID
Strand7 model file ID.
Thickness
Beam outline thickness in the range kMinThickness to kMaxThickness.